cf_billing/Documents/бестОперацияСОбъектамиНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бестОперацияСОбъектамиНП</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бестАктивностьОбъектовРасчета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контроллер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорНов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыРасчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектРасчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/бестАктивностьОбъектовРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестАктивностьОбъектовРасчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСостояниеТочекУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/бестВидыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бестВидыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>бестИзменениеИндивидуальныхНастроекСезонности_ВозобновлениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>бестИзменениеИндивидуальныхНастроекСезонности_ОграничениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>бестОбращения_ОбращениеФизическогоЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>бестОбращения_ОбращениеЮридическогоЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>бестРегистрацияПоказанийНП_РегистрацияКонтрольногоСъема</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>бестРегистрацияПоказанийНП_РегистрацияПоказаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>бестРегистрацияПоказанийНПОбщий_РегистрацияКонтрольногоСъема</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>бестРегистрацияПоказанийНПОбщий_РегистрацияПоказаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаНаЗаключениеДоговора_ЗаключениеДоговора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаНаЗаключениеДоговора_ЗаключениеДополнительногоСоглашения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаНаЗаключениеДоговора_РасторжениеДоговора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявлениеНаЗаключениеДоговора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменитьДанныеДляДополнительногоРасчета_НегативноеВоздействие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменитьДанныеДляДополнительногоРасчета_ПревышениеПДК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменитьДанныеДляДополнительногоРасчета_ПрочиеДополнительныеНачисления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСДоговором_АктБездоговорногоПотребления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСДоговором_ЗакрытиеДоговора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСДоговором_ЗаменаДоговораУОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСДоговором_ЗаявкаНаЗаключение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСДоговором_ОткрытиеДоговора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСДоговором_ПерезаключениеДоговора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСОбъектами_ЗаменаДоговораУОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСОбъектами_ОтключениеОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСОбъектами_ПодключениеОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСПриборомУчета_ВводПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСПриборомУчета_ВыводПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСПриборомУчета_ЗаменаПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСУслугами_ВозобновлениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСУслугами_ОграничениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСУслугами_ОтключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСУслугами_ПодключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСУслугами_ПодключениеУслугиПослеТП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перерасчет_РучнойПерерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перерасчет_СвязанныйПерерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСДоговором_РегистрацияОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменитьНомерПломбыПрибораУчета_Опломбировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменитьНомерПломбыПрибораУчета_Распломбировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменитьНомерПломбыПрибораУчета_ЗаменаПломбы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрацияБездоговорногоБезучетногоПотребления_БездоговорноеПотребление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрацияБездоговорногоБезучетногоПотребления_БезучетноеПотребление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктированиеНедопускаЮЛ_АктированиеНедопуска</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктированиеНедопускаЮЛ_АктированиеДопуска</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПочасоваяВедомость_ПлановоеПотребление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПочасоваяВедомость_ФактическоеПотребление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмененитьРазрядностьОбъемовУслуг_ОбщаяНастройка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмененитьРазрядностьОбъемовУслуг_ИндивидуальнаяНастройка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаЗадолженности_ВозвратПлатежа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаЗадолженности_ПереносПлатежа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежныйДокумент_Расчетный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежныйДокумент_СчетНаОстаток</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежныйДокумент_Корректировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПерерасчетЭЭ_КорректировкаИсправление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежныйДокумент_Исправление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписиКнигПродажПокупок_КнигаПродаж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписиКнигПродажПокупок_КнигаПокупок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежныйДокумент_Пеня</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеВосстановлениеЗадолженности_СписаниеЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеВосстановлениеЗадолженности_ВосстановлениеЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрацияБанкротства_ПризнаниеБанкротом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрацияБанкротства_ОтменаБанкротства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеструктуризацияЗадолженности_РегистрацияРеструктуризации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеструктуризацияЗадолженности_ОтменаРеструктуризации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПерерасчетЭЭ_СвязанныйПерерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПерерасчетЭЭ_РучнойПерерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>бестУстановитьФормулуРасчетаТочекУчетаНП_НачислениеПоФормуле</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>бестУстановитьФормулуРасчетаТочекУчетаНП_ОтменаНачисленийПоФормуле</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаЗадолженности_ПереносВозвратПлатежа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСПриборомУчета_ЗаменаВспомогательногоПУ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Enums/энргСостояниеТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргСостояниеТочекУчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Включена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отключена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОРП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоТП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Documents/бестОперацияСОбъектамиНП/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;	
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	//
	//Если РежимЗаписи = РежимЗаписиДокумента.Проведение и ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги тогда
	//	
	//	СоотвествиеКолонок  = Новый Структура;
	//	СоотвествиеКолонок.Вставить("Наименование",	"НаименованиеТочки");
	//	СоотвествиеКолонок.Вставить("Расположение",	"Расположение");
	//	СоотвествиеКолонок.Вставить("Головная",		"Головная");
	//	
	////	энргРаботаСТочкамиУчетаСервер.ПроверитьИСоздатьТочкиУчета(ЭтотОбъект,"ТочкиУчета",СоотвествиеКолонок);
	//	
	//	
	//КонецЕсли;			  
	
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);
	  //энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ЗначениеЗаполнено(ДатаФактическогоСобытия) тогда
		Момент 			= Новый Граница(Новый МоментВремени(КонецДня(ДатаФактическогоСобытия),Ссылка), ВидГраницы.Исключая);
		СтрокаОтказа 	= "На дату фактического события";
	иначе
		Момент 			= Новый Граница(МоментВремени(),ВидГраницы.Исключая);
		СтрокаОтказа 	= "На дату операции";
	КонецЕсли;	
	
	ДоговорОткрыт=бестПроверкаДанныхКонтрагентаСервер.ДоговорЗаключен(Момент,организация, район, Договор);
	
	Если Не ДоговорОткрыт Тогда
		Отказ			= Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("" + СтрокаОтказа + " договор закрыт");
	КонецЕсли;
	
	МодульРаботаСТочкамиУчетаПомещенийСервер = ОбщегоНазначения.ОбщийМодуль("бестРаботаСТочкамиУчетаПомещенийСервер");
	
	ОбъектыОтлючены = МодульРаботаСТочкамиУчетаПомещенийСервер.ОбъектыДоговораОтлючены(Новый Структура("МоментВремени,
		|Район,Организация,Договор,МассивОбъектов", Момент, Район, Организация, Договор,
		ОбъектыРасчета.ВыгрузитьКолонку("ОбъектРасчета")));
	
	Если ВидОперации = Перечисления.бестВидыОпераций.ОперацияСОбъектами_ПодключениеОбъекта И Не ОбъектыОтлючены Тогда
		Отказ			= Истина;   
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("" + СтрокаОтказа + " выбранные объекты уже подключены");
	КонецЕсли;
		
	Если ВидОперации = Перечисления.бестВидыОпераций.ОперацияСОбъектами_ОтключениеОбъекта И ОбъектыОтлючены Тогда 
		Отказ			= Истина;   
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("" + СтрокаОтказа + " выбранные объекты уже отключены");
	КонецЕсли;
	
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	Если ВидОперации = Перечисления.бестВидыОпераций.ОперацияСОбъектами_ЗаменаДоговораУОбъекта Тогда 
		ДанныеШапки = ДанныеШапки(Перечисления.энргСостояниеТочекУчета.Отключена, Договор);	
		бестПроведениеСерверНП.ВыполнитьДвижения(ДанныеШапки, Движения.бестАктивностьОбъектовРасчета, "ОбъектыРасчета");
		
		ДанныеШапки = ДанныеШапки(Перечисления.энргСостояниеТочекУчета.Включена, ДоговорНов);	
		бестПроведениеСерверНП.ВыполнитьДвижения(ДанныеШапки, Движения.бестАктивностьОбъектовРасчета, "ОбъектыРасчета");
		бестПроведениеСерверНП.ВыполнитьДвижения(ДанныеШапки, Движения.бестВладельцыОбъектовРасчета, "ОбъектыРасчета");
		
	ИначеЕсли ВидОперации = Перечисления.бестВидыОпераций.ОперацияСОбъектами_ПодключениеОбъекта Тогда 
		ДанныеШапки = ДанныеШапки(Перечисления.энргСостояниеТочекУчета.Включена, Договор);	
		бестПроведениеСерверНП.ВыполнитьДвижения(ДанныеШапки, Движения.бестАктивностьОбъектовРасчета, "ОбъектыРасчета");
		бестПроведениеСерверНП.ВыполнитьДвижения(ДанныеШапки, Движения.бестВладельцыОбъектовРасчета, "ОбъектыРасчета");
		
	ИначеЕсли ВидОперации = Перечисления.бестВидыОпераций.ОперацияСОбъектами_ОтключениеОбъекта Тогда 
		
		ДанныеШапки = ДанныеШапки(Перечисления.энргСостояниеТочекУчета.Отключена, Договор);	
		бестПроведениеСерверНП.ВыполнитьДвижения(ДанныеШапки, Движения.бестАктивностьОбъектовРасчета, "ОбъектыРасчета");	
		
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеШапки(ТекВидОперации, ТекДоговор)
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("Период",					?(ЗначениеЗаполнено(ДатаФактическогоСобытия),КонецДня(ДатаФактическогоСобытия),Дата));
	ДанныеШапки.Вставить("ПериодНачисления",		ПериодНачисления);
	ДанныеШапки.Вставить("ПериодРегистрации",		Дата);
	ДанныеШапки.Вставить("Организация",				Организация);
	ДанныеШапки.Вставить("Район",					Район);
	ДанныеШапки.Вставить("Договор",					ТекДоговор);
	ДанныеШапки.Вставить("Состояние",				ТекВидОперации);//?(ВидОперации=Перечисления.бестВидыОпераций.ОперацияСОбъектами_ОтключениеОбъекта,  Перечисления.энргСостояниеТочекУчета.Отключена, Перечисления.энргСостояниеТочекУчета.Включена));
	ДанныеШапки.Вставить("ОбъектыРасчета",			ОбъектыРасчета);
	
	Возврат ДанныеШапки;	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
